In [1]:
import numpy as np
import pandas as pd
import  matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('Raw Data/Real_Estate.csv')
df.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009,NaN,73080.0,152000.0,Single Family,Detached House,3,1,935.0,1.025953,North
2,2009-01-02,2009,Waterbury,50540.0,105000.0,Single Family,Detached House,3,1,951.0,1.025953,East
3,2009-01-02,2009,Norwalk,571060.0,1000000.0,Single Family,Detached House,3,2,NaN,1.025953,South
4,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East

In [4]:
df.isnull().sum()

Date                    0
Year                    0
Locality             1255
Estimated Value      1229
Sale Price              0
Property                0
Residential             0
num_rooms               0
num_bathrooms           0
carpet_area          1282
property_tax_rate       0
Face                    0
dtype: int64

In [6]:
df.dropna(inplace=True)
df.isnull().sum()

Date                 0
Year                 0
Locality             0
Estimated Value      0
Sale Price           0
Property             0
Residential          0
num_rooms            0
num_bathrooms        0
carpet_area          0
property_tax_rate    0
Face                 0
dtype: int64

In [7]:
df.shape

(6680, 12)

In [8]:
df.columns

Index(['Date', 'Year', 'Locality', 'Estimated Value', 'Sale Price', 'Property',
       'Residential', 'num_rooms', 'num_bathrooms', 'carpet_area',
       'property_tax_rate', 'Face'],
      dtype='object')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6680 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date               6680 non-null   object
 1   Year               6680 non-null   int64
 2   Locality           6680 non-null   object
 3   Estimated Value    6680 non-null   float64
 4   Sale Price         6680 non-null   float64
 5   Property           6680 non-null   object
 6   Residential        6680 non-null   object
 7   num_rooms          6680 non-null   int64
 8   num_bathrooms      6680 non-null   int64
 9   carpet_area        6680 non-null   float64
 10  property_tax_rate  6680 non-null   float64
 11  Face               6680 non-null   object
dtypes: float64(4), int64(3), object(5)
memory usage: 678.4+ KB

In [10]:
df.describe()

,Year,Estimated Value,Sale Price,num_rooms,num_bathrooms,carpet_area,property_tax_rate
count,6680.000000,6.680000e+03,6.680000e+03,6680.000000,6680.000000,6680.000000,6680.000000
mean,2015.865269,4.485923e+05,6.265521e+05,3.326946,2.328443,1110.888323,1.143156
std,4.086590,7.872453e+05,1.077250e+06,0.877421,1.206324,301.361170,0.166521
min,2009.000000,0.000000e+00,2.500000e+03,3.000000,1.000000,900.000000,1.003979
25%,2012.000000,1.313650e+05,1.620000e+05,3.000000,1.000000,960.000000,1.023495
50%,2016.000000,2.420450e+05,3.380000e+05,3.000000,2.000000,1022.000000,1.025899
75%,2019.000000,4.414250e+05,6.276250e+05,3.000000,3.000000,1082.000000,1.348259
max,2022.000000,2.111991e+07,2.575000e+07,8.000000,8.000000,2989.000000,1.422308

In [13]:
df['Locality'].value_counts()

Locality
Bridgeport       1291
Waterbury        1150
Fairfield        1035
West Hartford     842
Greenwich         809
Norwalk           777
Stamford          776
Name: count, dtype: int64

In [15]:
df.to_csv('Clean_Data/Real_Estate.csv')